/* Interpret BF program from IFS */

PGM PARM(&IFSPATH)
  
  /* Parms */
  DCL VAR(&IFSPATH) TYPE(*CHAR) LEN(127)

  /* Variables */
  DCL VAR(&BFSRC)   TYPE(*CHAR) LEN(4096)
  DCL VAR(&OUTBUFFER) TYPE(*CHAR) LEN(52)

  /* Read BF program from IFS */
  CALL PGM(IFSREAD) PARM(&IFSPATH &BFSRC)

  /* Interpret BF program */
  /* CALL PGM(BFINT) PARM(&BFSRC &OUTBUFFER) */

ENDPGM